In [2]:
import pandas as pd
import numpy as np

s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [3]:
sozluk = {"var1" : s1,
          "var2" : s2,
          "var3" : s3
         }

sozluk

{'var1': array([6, 4, 2, 8, 7]),
 'var2': array([9, 0, 0, 9, 6]),
 'var3': array([1, 3, 3, 3, 7])}

In [5]:
df = pd.DataFrame(sozluk) #sozluk uzerinden dataFrame olusturma;
df

   var1  var2  var3
0     6     9     1
1     4     0     3
2     2     0     3
3     8     9     3
4     7     6     7

In [6]:
df[0:1]

   var1  var2  var3
0     6     9     1

In [7]:
df.index = ["a", "b", "c", "d", "e"]
df

   var1  var2  var3
a     6     9     1
b     4     0     3
c     2     0     3
d     8     9     3
e     7     6     7

In [8]:
#silme

In [9]:
df.drop("a", axis = 0) #a satırını sil. AMA ana yapı üzerinde degisiklik yapılmadı 
#orjinal df aynı

   var1  var2  var3
b     4     0     3
c     2     0     3
d     8     9     3
e     7     6     7

In [10]:
df

   var1  var2  var3
a     6     9     1
b     4     0     3
c     2     0     3
d     8     9     3
e     7     6     7

In [11]:
#ancak kalıcı olarak gitsin istiyorsa inplace = true kullanırız

In [12]:
df.drop("a", axis = 0, inplace = True)#inplace true old. icin a satırı kalıcı olarak gitti

In [13]:
df

   var1  var2  var3
b     4     0     3
c     2     0     3
d     8     9     3
e     7     6     7

In [14]:
#fancy

In [15]:
silinecek_indexler = ["c", "e"]

In [16]:
df.drop(silinecek_indexler, axis = 0)

   var1  var2  var3
b     4     0     3
d     8     9     3

In [17]:
#degsikenler icin

In [18]:
"var1" in df

True

In [19]:
degiskenler = ["var1", "var4", "var2"]

In [21]:
for i in degiskenler:
    print(i in df)  #df'in icinde gez, degiskenler listesindeki her bir degiskeni tek tek sor var mı diye

True
False
True

In [22]:
df

   var1  var2  var3
b     4     0     3
c     2     0     3
d     8     9     3
e     7     6     7

In [24]:
#yeni degisken olusturma

In [29]:
df["var4"] = df["var1"]*df["var2"]# !!! var4 olmadığı icin olusturmaya karar verir.
df["var5"] = df["var1"]*df["var3"]# !!! var5 olmadığı icin olusturmaya karar verir.

In [30]:
df

   var1  var2  var3  var4  var5
b     4     0     3     0    12
c     2     0     3     0     6
d     8     9     3    72    24
e     7     6     7    42    49

In [31]:
#degisken silme;

In [32]:
df.drop("var4", axis = 1)

   var1  var2  var3  var5
b     4     0     3    12
c     2     0     3     6
d     8     9     3    24
e     7     6     7    49

In [33]:
df

   var1  var2  var3  var4  var5
b     4     0     3     0    12
c     2     0     3     0     6
d     8     9     3    72    24
e     7     6     7    42    49

In [34]:
df.drop("var4", axis = 1, inplace=True)

In [37]:
silinecekler = ["var1" ,"var2"] #fancy index

In [36]:
df.drop(silinecekler, axis = 1)#fancy index

   var3  var5
b     3    12
c     3     6
d     3    24
e     7    49